{"inkVersion":20,"root":[[{"->":"dialogue"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"dialogue":["^Siapa kau wahai hantu? ",{"#":"speaker:Ruu"},"\n","^Selamat datang, anak muda! Aku Ghosto, penjaga reruntuhan ini. Kau tampak bingung, apa yang kau cari di sini? ",{"#":"speaker:Ghosto"},"\n","^Aku terjebak di sini dan mencari jalan keluar. Apa yang harus aku lakukan? ",{"#":"speaker:Ruu"},"\n","^Untuk keluar, kau harus mengumpulkan rune dan menggunakan kekuatannya. Di sekitar sini, kau akan menemukan rune NOT, OR, dan AND. Mereka tersebar di berbagai tempat, jadi kau perlu mencari dan mengumpulkan mereka terlebih dahulu. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"question":[["^Apa ada hal lain yang ingin kau tanyakan? ",{"#":"speaker:Ghosto"},"\n","ev","str","^Rune","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Apa","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Bagaimana","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Tidak","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":"rune"},{"#f":5}],"c-1":["\n",{"->":"apa"},{"#f":5}],"c-2":["\n",{"->":"bagaimana"},{"#f":5}],"c-3":["\n","end",{"#f":5}]}],{"#f":1}],"rune":["^Ghosto, bisa jelaskan lebih lanjut tentang rune ini?  ",{"#":"speaker:Ruu"},"\n","^Tentu, anak muda. Rune NOT bisa membalikkan efek atau keadaan. Rune OR dapat diaktifkan jika salah satu input/masukan bernilai true, ",{"#":"speaker:Ghosto"},"\n","^dan rune AND dapat diaktifkan jika semua input/masukan bernilai true. Menggunakan rune dengan bijak akan membantumu mengatasi rintangan di sini. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"apa":["^Apa yang harus aku lakukan sekarang, Ghosto?  ",{"#":"speaker:Ruu"},"\n","^Langkah pertama adalah mengumpulkan semua rune yang tersebar di lantai ini. Setelah itu, gunakan kekuatan mereka untuk mengalahkan monster dan membuka jalan keluar. Jangan lupa untuk mencari pot-pot yang bisa dihancurkan. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"bagaimana":["^Setelah aku mengumpulkan rune, apa yang harus aku lakukan selanjutnya? ",{"#":"speaker:Ruu"},"\n","^Setelah mengumpulkan semua rune, gunakan kekuatan mereka untuk mengatasi rintangan dan monster yang menghadang. Setiap rune memiliki kekuatan unik yang bisa membantumu. ",{"#":"speaker:Ghosto"},"\n","^Kamu bisa membuka inventarismu untuk menyelesaikan rangkaian rune sehingga rune tersebut dapat memberimu ketahanan terhadap elemen. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"#f":1}],"listDefs":{}}