{"inkVersion":20,"root":[[{"->":"dialogue"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"dialogue":["^Aku mendapatkan semua rune! Apa selanjutnya? ",{"#":"speaker:Ruu"},"\n","^Sekarang, kau buka skill inventarismu dan lihat puzzle susunan gerbang logika yang harus diselesaikan. Dengan begitu, kau bisa mengalahkan monster yang ada di sekelilingmu. ",{"#":"speaker:Ghosto"},"\n","^Ingat juga untuk mengambil poin yang dijatuhkan oleh monster-monster itu. ",{"#":"speaker:Ghosto"},"\n","^Terimakasih Ghosto, tapi aku lihat tadi ada monster besar yang mengerikan, bagaimana dengan monster itu? ",{"#":"speaker:Ruu"},"\n","^Kau benar anak muda, ada boss monster spesial yang hanya bisa dikalahkan setelah kau menyelesaikan semua skilll elemenmu dan kemudian menyelesaikan sususan skill spesial. Semoga beruntung kali ini. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"question":[["^Apa ada hal lain yang ingin kau tanyakan? ",{"#":"speaker:Ghosto"},"\n","ev","str","^Skill","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Monster","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Gerbang","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Tidak","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":"skill"},{"#f":5}],"c-1":["\n",{"->":"monster"},{"#f":5}],"c-2":["\n",{"->":"gerbang"},{"#f":5}],"c-3":["\n","end",{"#f":5}]}],{"#f":1}],"skill":["^Ghosto, bagaimana cara mengaktifkan skill dengan rune ini?  ",{"#":"speaker:Ruu"},"\n","^Untuk mengaktifkan skill, kau harus menyelesaikan susunan gerbang logika di skill inventarismu. Pastikan salah satu input/masukan bernilai true dan output menggunakan rune yang sesuai. ",{"#":"speaker:Ghosto"},"\n","^Misalnya, untuk skill api, gunakan output rune OR dan pastikan output bernilai true. Untuk skill spesial output rune yang digunakan bebas. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"monster":["^Bagaimana cara terbaik untuk mengalahkan monster dengan rune ini?  ",{"#":"speaker:Ruu"},"\n","^Setiap monster memiliki kelemahan terhadap elemen tertentu. Gunakan rune OR untuk mengaktifkan skill ketahanan api dan mengalahkan monster api. ",{"#":"speaker:Ghosto"},"\n","^Untuk monster air, gunakan rune AND untuk mengaktifkan skill ketahanan air. Dan skill spesial untuk mengalahkan boss monster spesial. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"gerbang":["^Bagaimana cara membuka gerbang penghalang dengan rune ini? ",{"#":"speaker:Ruu"},"\n","^Susun rune NOT, OR, dan AND pada rangkaian gerbang logika di sekitar gerbang. Pastikan susunan rune tersebut sesuai dengan pola yang dibutuhkan untuk membuka penghalang seperti kau menyelesaikan susunan rune pada skillmu. ",{"#":"speaker:Ghosto"},"\n","^Setelah selesai, penghalang akan menghilang dan kau bisa melanjutkan perjalananmu. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"#f":1}],"listDefs":{}}