{"inkVersion":20,"root":[[{"->":"dialogue"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"dialogue":["^Kita bertemu lagi anak muda. Di sini, kau akan mendapatkan rune NOR dan NAND. Mereka tersebar di sekitar sini, jadi kau perlu menemukannya terlebih dahulu. ",{"#":"speaker:Ghosto"},"\n","^Baik, aku akan mencarinya. Tapi, bagaimana dengan monster di sini? ",{"#":"speaker:Ruu"},"\n","^Monster di sini lebih kuat, tapi kau bisa mengalahkan mereka dengan skill ketahanan elemen angin dari rune NOR dan skill ketahanan tanah dari rune NAND. ",{"#":"speaker:Ghosto"},"\n","^Jangan lupa juga untuk mengumpulkan poin yang dijatuhkan oleh monster yang telah kau kalahkan serta menghancurkan pot-pot yang kau temui. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"question":[["^Apa ada hal lain yang ingin kau tanyakan? ",{"#":"speaker:Ghosto"},"\n","ev","str","^Rune","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Informasi","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Apa","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Tidak","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":"rune"},{"#f":5}],"c-1":["\n",{"->":"informasi"},{"#f":5}],"c-2":["\n",{"->":"Apa"},{"#f":5}],"c-3":["\n","end",{"#f":5}]}],{"#f":1}],"rune":["^Ghosto, bisa jelaskan lebih lanjut tentang rune NOR dan NAND ini?  ",{"#":"speaker:Ruu"},"\n","^Tentu, anak muda. Rune NOR dapat membalik kekuatan rune OR dengan kata lain semua input/masukan harus bernilai false sehingga output rune bernilai true. ",{"#":"speaker:Ghosto"},"\n","^Rune NAND dapat membalik kekuatan rune AND dengan kata lain salah satu atau semua input/masukan bernilai false sehingga output rune bernilai true. Gunakan kekuatan mereka dengan bijak. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"informasi":["^Bagaimana cara melihat informasi lebih lanjut tentang rune yang aku miliki?  ",{"#":"speaker:Ruu"},"\n","^Kau bisa membuka inventarismu dan melihat deskripsi setiap rune. Di sana, kau akan menemukan informasi tentang kekuatan dan cara menggunakan setiap rune. Ini akan membantumu dalam perjalananmu. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"Apa":["^Apa yang harus aku persiapkan untuk perjalanan ke area berikutnya? ",{"#":"speaker:Ruu"},"\n","^Pastikan kau telah mengumpulkan semua rune dan mempelajari semua kegunaan rune NOT, OR, AND, NOR, NAND. Setiap lantai memiliki tantangan yang berbeda, jadi bersiaplah untuk menghadapi rintangan baru. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"#f":1}],"listDefs":{}}