{"inkVersion":20,"root":[[{"->":"dialogue"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"dialogue":["^Kau semakin dekat dengan tujuanmu, anak muda. Di lantai ini, kau akan mempelajari rune XOR dan XNOR. Mereka tersebar di sini, jadi kau perlu mencarinya. ",{"#":"speaker:Ghosto"},"\n","^Aku siap. Bagaimana dengan monster di sini? ",{"#":"speaker:Ruu"},"\n","^Monster di sini berelemen cahaya dan gelap. Rune XOR memberikan ketahanan terhadap cahaya yang bisa mengalahkan monster berelemen cahaya. ",{"#":"speaker:Ghosto"},"\n","^Rune XNOR memberikan ketahanan gelap yang bisa mengalahkan monster berelemen gelap. Gunakan mereka dengan bijak untuk mengatasi rintangan. Ini akan mengantarkanmu ke tujuan terakhir. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"question":[["^Apa ada hal lain yang ingin kau tanyakan? ",{"#":"speaker:Ghosto"},"\n","ev","str","^Rune","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Monster","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Misteri","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Tidak","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":"rune"},{"#f":5}],"c-1":["\n",{"->":"monster"},{"#f":5}],"c-2":["\n",{"->":"misteri"},{"#f":5}],"c-3":["\n","end",{"#f":5}]}],{"#f":1}],"rune":["^Ghosto, bisa jelaskan lebih lanjut tentang fungsi rune XOR dan XNOR ini?  ",{"#":"speaker:Ruu"},"\n","^Tentu, anak muda. Rune XOR dapat diaktifkan hanya jika ada satu input/masukan bernilai true maka output rune akan bernilai true.","\n","^Rune XNOR membalik kekuatan rune XOR dengan kata lain semua input/masukan harus bernilai sama true atau false agar output rune bernilai true ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"monster":["^Bagaimana cara mengalahkan monster dan boss di lantai ini? ",{"#":"speaker:Ruu"},"\n","^Monster di sini lemah terhadap elemen cahaya dan gelap. Gunakan rune XOR untuk mengaktifkan skill cahaya dan rune XNOR untuk mengaktifkan skill gelap. ",{"#":"speaker:Ghosto"},"\n","^Boss monster bisa dikalahkan dengan menggunakan skill spesial, jadi perhatikan susunan rune yang digunakan. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"misteri":["^Ghosto, apa sebenarnya rune itu dan dari mana asalnya? ",{"#":"speaker:Ruu"},"\n","^Rune adalah simbol kuno yang mengandung kekuatan elemen dan logika. Mereka diciptakan oleh para penjaga reruntuhan untuk melindungi tempat ini dan menyimpan kekuatan besar. ",{"#":"speaker:Ghosto"},"\n","^Setiap rune memiliki kekuatan unik yang bisa digunakan untuk mengatasi rintangan dan mengalahkan monster. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"#f":1}],"listDefs":{}}