{"inkVersion":20,"root":[[{"->":"dialogue"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"dialogue":["^Ini adalah tantangan terakhir, anak muda. Gunakan semua rune: NOT, OR, AND, NOR, NAND, XOR, dan XNOR. Ini adalah ujian akhir untuk melihat seberapa baik kau memahami kekuatan rune. ",{"#":"speaker:Ghosto"},"\n","^Aku siap, Ghosto. Aku akan menggunakan semua pengetahuan yang telah aku pelajari. ",{"#":"speaker:Ruu"},"\n","^Ingat, setiap rune memiliki peran penting. Susun mereka dengan hati-hati. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"question":[["^Apa ada hal lain yang ingin kau tanyakan? ",{"#":"speaker:Ghosto"},"\n","ev","str","^Rune","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Apa","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Bagaimana","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Tidak","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":"rune"},{"#f":5}],"c-1":["\n",{"->":"apa"},{"#f":5}],"c-2":["\n",{"->":"bagaimana"},{"#f":5}],"c-3":["\n","end",{"#f":5}]}],{"#f":1}],"rune":["^Tentu, anak muda. Berikut adalah fungsi masing-masing rune: NOT Membalikkan keadaan. Jika input adalah true, output menjadi false, dan sebaliknya. ",{"#":"speaker:Ghosto"},"\n","^OR Memberikan ketahanan api dapat diaktifkan jika salah satu input/masukan bernilai true. AND Memberikan ketahanan air dapat diaktifkan jika semua input/masukan bernilai true. ",{"#":"speaker:Ghosto"},"\n","^NOR Memberikan ketahanan angin dan membalikkan rune OR. NAND Memberikan ketahanan tanah dan membalikkan rune AND. ",{"#":"speaker:Ghosto"},"\n","^XOR Memberikan ketahanan cahaya dapat diaktifkan hanya jika ada satu saja input/masukan bernilai true maka output rune akan bernilai true. ",{"#":"speaker:Ghosto"},"\n","^XNOR Memberikan ketahanan gelap dapat membalik kekuatan rune XOR dengan kata lain semua input/masukan harus bernilai sama hanya true atau false saja agar output rune bernilai true. ",{"#":"speaker:Ghosto"},"\n","^Gunakan mereka dengan bijak untuk mengatasi rintangan. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"apa":["^Ghosto, kenapa rangkaian gerbang logika ini terasa sangat sulit?  ",{"#":"speaker:Ruu"},"\n","^Rangkaian gerbang logika dirancang untuk menguji pemahamanmu tentang bagaimana setiap rune bekerja dan bagaimana mereka bisa digabungkan untuk menyelesaikan teka-teki. ",{"#":"speaker:Ghosto"},"\n","^Kesulitan ini membantu memastikan bahwa kau benar-benar memahami kekuatan dan aplikasi dari setiap rune. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"bagaimana":["^Apa kegunaan star dan poin yang aku kumpulkan dari monster? ",{"#":"speaker:Ruu"},"\n","^Star dan point yang kau kumpulkan merupakan salah satu yang harus kau penuhi agar bisa digunakan untuk membuka penghalang tersembunyi dalam perjalanan hingga akhir tujuanmu. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"#f":1}],"listDefs":{}}