{"inkVersion":20,"root":[[{"->":"dialogue"},["done",{"#f":5,"#n":"g-0"}],null],"done",{"dialogue":["^Terima kasih, Ghosto. Tanpa bantuanmu, aku tidak akan bisa keluar dari sini. ",{"#":"speaker:Ruu"},"\n","^Kau telah membuktikan dirimu, anak muda. Kekuatan dan kebijaksanaanmu telah membantumu melewati setiap tantangan. Selamat jalan, dan ingatlah pelajaran yang telah kau pelajari di sini. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"question":[["^Apa ada hal lain yang ingin kau tanyakan? ",{"#":"speaker:Ghosto"},"\n","ev","str","^Apa","/str","/ev",{"*":".^.c-0","flg":20},"ev","str","^Terimakasih","/str","/ev",{"*":".^.c-1","flg":20},"ev","str","^Bermanfaat","/str","/ev",{"*":".^.c-2","flg":20},"ev","str","^Tidak","/str","/ev",{"*":".^.c-3","flg":20},{"c-0":["\n",{"->":"apa"},{"#f":5}],"c-1":["\n",{"->":"terimakasih"},{"#f":5}],"c-2":["\n",{"->":"bermanfaat"},{"#f":5}],"c-3":["\n","end",{"#f":5}]}],{"#f":1}],"apa":["^Ghosto, apa yang akan terjadi setelah aku meninggalkan reruntuhan ini?  ",{"#":"speaker:Ruu"},"\n","^Setelah kau meninggalkan reruntuhan, perjalananmu masih panjang. Gunakan pengetahuan dan kekuatan rune yang telah kau pelajari untuk menghadapi tantangan di luar sana. Dunia ini penuh dengan misteri dan petualangan yang menantimu. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"terimakasih":["^Terima kasih banyak atas semua penjelasan tentang rune, Ghosto. Itu sangat membantu.  ",{"#":"speaker:Ruu"},"\n","^Senang bisa membantu, anak muda. Pengetahuan tentang rune adalah kunci untuk memahami kekuatan yang ada di dunia ini. Gunakan pengetahuan itu dengan bijak dan teruslah belajar. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"bermanfaat":["^Semoga semua yang aku pelajari di sini bermanfaat untuk perjalanan selanjutnya. ",{"#":"speaker:Ruu"},"\n","^Aku yakin itu akan sangat bermanfaat, anak muda. Kau telah menunjukkan keberanian dan kecerdasan yang luar biasa. Teruslah maju dan jangan pernah ragu untuk menggunakan kekuatan yang telah kau pelajari. ",{"#":"speaker:Ghosto"},"\n",{"->":"question"},{"#f":1}],"#f":1}],"listDefs":{}}